In [5]:
import numpy as np

In [6]:
import pandas as pd

In [7]:
labels = ['a','b','c']
my_data = [10, 20 ,30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30} #now have four seprate python objects

In [8]:
labels

['a', 'b', 'c']

In [9]:
pd.Series(data = my_data) #we have an index
#key to a panda series is you can specify what you want the index to be

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(arr) #can pass in any numpy array

0    10
1    20
2    30
dtype: int64

In [16]:
pd.Series(d) #can pass in a dictionary
#take the keys and pass it as an index

a    10
b    20
c    30
dtype: int64

In [17]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [18]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [19]:
ser1 = pd.Series([1,2,3,4],['USA', 'Germany','USSR', 'Japan'])

In [21]:
ser2 = pd.Series([1,2,3,4,],['USA','Germany', 'Italy', 'Japan'])

In [23]:
ser1['USA']

1

In [24]:
ser3 = pd.Series(data=labels)

In [25]:
ser3 #shows that the data type is an object

0    a
1    b
2    c
dtype: object

In [26]:
ser3[1]

'b'

In [27]:
ser1 + ser2 #going to try and match the operation based off the index; where
#it is going to put a null

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [28]:
import numpy as np
import pandas as pd

In [29]:
from numpy.random import randn

In [30]:
np.random.seed(101)

In [33]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z']) #index then columns

In [34]:
df #printed output 
#we have a list a columns wxyyz and correspodning rows abcde
#each of the columns is just a panda series
#all share a common index

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [38]:
 df['W'] #the W column is just a series
#the way to grab a column from the data frame

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [41]:
df.W #similiar to sql, can also grab a colum this way
#recommend not using this

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [43]:
df[['W','Y']] #if you wanted mutiple columns; notice the two brackets

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905
C  0.807706  0.638787
D -0.497104 -0.943406
E -0.116773  0.238127

In [44]:
df['new'] = df['W'] + df['Y'] #creating a new column

In [45]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [47]:
df.drop('new',axis=1) #how to remove a column 
#drop method axis=0 refers to index, axis=1 refers to column

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [48]:
df #in place arugment; inplace argument needs to be set to true
#if you add inplace=True after axis=1, the new column will be permantly removed from df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [49]:
df.drop('E')

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510

In [51]:
df.shape #shows the df is a tuple
#at the zero index are the number, and at the one index are the number of columns

(5, 5)

In [52]:
df.loc['B'] #not only are the column series but the rows are series as well

W     -0.134841
X      0.390528
Y      0.166905
Z      0.184502
new    0.032064
Name: B, dtype: float64

In [53]:
#Selecting Subset of Rows and Columns 
df.loc['C','Z'] #row then column

0.32964629880452445

In [54]:
df.loc[['C','D'],['Y','Z']]

          Y         Z
C  0.638787  0.329646
D -0.943406  0.484752

In [55]:
#conditional selection Data Frame Part 2

In [58]:
booldf = df > 0 #will get a dataframe
#of boolean vcalues where it is greater than zero and where it was not greater than zero

In [59]:
booldf

       W      X      Y      Z    new
A   True   True  False  False  False
B  False   True   True   True   True
C   True   True   True   True   True
D  False  False  False   True  False
E  False   True   True   True   True

In [60]:
df[booldf] #will get values where it was true and null where it was false

          W         X         Y         Z       new
A  0.302665  1.693723       NaN       NaN       NaN
B       NaN  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D       NaN       NaN       NaN  0.484752       NaN
E       NaN  1.901755  0.238127  1.996652  0.121354

In [61]:
df[df>0] #data frame with comparison operator

          W         X         Y         Z       new
A  0.302665  1.693723       NaN       NaN       NaN
B       NaN  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D       NaN       NaN       NaN  0.484752       NaN
E       NaN  1.901755  0.238127  1.996652  0.121354

In [63]:
df['W']>0 #comparison operator with column
#linked with actual index
#can use series boolean values, to filter out rows based on a column's value

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [64]:
df[df['W']>0] #pass in series using data frame using bracket notation
#will only get rows where this happens to be true

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
C  0.807706  0.072960  0.638787  0.329646  1.446493

In [65]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [67]:
df[df['Z']<0] #looking for the column were it less than zero
#asking to return the entire data frame back so it should return the row

          W         X         Y         Z      new
A  0.302665  1.693723 -1.706086 -1.159119 -1.40342

In [73]:
resultdf = df[df['W']<0]

In [74]:
resultdf['X'] #can grab results from this

B    0.390528
D   -0.754070
E    1.901755
Name: X, dtype: float64

In [76]:
df[df['W']>0]['X'] #instead of doing two steps can just do everything on one line
#can bracket for mutiple columns by passing in a list

A    1.693723
C    0.072960
Name: X, dtype: float64

In [78]:
df[df['W']>0][['Y','X']]#notice the two brackets

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

In [85]:
boolser = df['W']<.5
result = df[boolser]

In [87]:
result #should display whereever that series was true

          W         X         Y         Z       new
B -0.134841  0.390528  0.166905  0.184502  0.032064
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [89]:
result[['X','Y']] #from the result can call list of columns

          X         Y
B  0.390528  0.166905
D -0.754070 -0.943406
E  1.901755  0.238127

In [90]:
df[df['Y']>0] #returning a subset of the data frame based off of one condition

          W         X         Y         Z       new
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [93]:
df[(df['Y']>0) & (df['Z']>1)] #have to use & not and

          W         X         Y         Z       new
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [94]:
df[(df['Y']>0) | (df['Z']>1)] #have to | not or

          W         X         Y         Z       new
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [97]:
df.reset_index() #get the index reset to a column 
#does not occur in place unless you tell it to

  index         W         X         Y         Z       new
0     A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
1     B -0.134841  0.390528  0.166905  0.184502  0.032064
2     C  0.807706  0.072960  0.638787  0.329646  1.446493
3     D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
4     E -0.116773  1.901755  0.238127  1.996652  0.121354

In [100]:
newind = 'CA NY OH TX FL'.split() #split, an easy way to turn things into a list

In [101]:
newind

['CA', 'NY', 'OH', 'TX', 'FL']

In [102]:
df['States'] = newind

In [103]:
df

          W         X         Y         Z       new States
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420     CA
B -0.134841  0.390528  0.166905  0.184502  0.032064     NY
C  0.807706  0.072960  0.638787  0.329646  1.446493     OH
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510     TX
E -0.116773  1.901755  0.238127  1.996652  0.121354     FL

In [104]:
df.set_index('States') #you can set the column that you want to be the new index
#now the states column has become the index
#unless you retain info of the old index, this will overwrite the old index

               W         X         Y         Z       new
States
CA      0.302665  1.693723 -1.706086 -1.159119 -1.403420
NY     -0.134841  0.390528  0.166905  0.184502  0.032064
OH      0.807706  0.072960  0.638787  0.329646  1.446493
TX     -0.497104 -0.754070 -0.943406  0.484752 -1.440510
FL     -0.116773  1.901755  0.238127  1.996652  0.121354

In [10]:
#Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) #used zip function and list function
#used list and zip in order to create tuple pairs
hier_index = pd.MultiIndex.from_tuples(hier_index) #function for pandas

In [14]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

NameError: name 'randn' is not defined